# -*- coding: utf-8; -*-


**** evil-cleverparens
     #+BEGIN_SRC emacs-lisp
     (add-hook 'elisp-mode  #'evil-cleverparens-mode)
     (add-hook 'scheme-mode #'evil-cleverparens-mode)
     #+END_SRC

     #+RESULTS:
     | evil-cleverparens-mode |

** emacs state
   #+BEGIN_SRC emacs-lisp
     (append-to-list
      'evil-emacs-state-modes
      '(
        svn-status-mode
        dvc-log-edit-mode
        project-buffer-mode
        gtags-selection-mode
        speedbar-mode
        picpocket-mode
        vterm-mode
        elfeed-mode
        bufler-mode
        bufler-list-mode
        ))
   #+END_SRC

   #+RESULTS:
   | org-brain-visualize-mode | 5x5-mode | bbdb-mode | biblio-selection-mode | blackbox-mode | bookmark-bmenu-mode | bookmark-edit-annotation-mode | browse-kill-ring-mode | bubbles-mode | bzr-annotate-mode | calc-mode | cfw:calendar-mode | completion-list-mode | custom-theme-choose-mode | debugger-mode | delicious-search-mode | desktop-menu-blist-mode | desktop-menu-mode | dun-mode | dvc-bookmarks-mode | dvc-diff-mode | dvc-info-buffer-mode | dvc-log-buffer-mode | dvc-revlist-mode | dvc-revlog-mode | dvc-status-mode | dvc-tips-mode | ediff-mode | ediff-meta-mode | efs-mode | Electric-buffer-menu-mode | emms-browser-mode | emms-mark-mode | emms-metaplaylist-mode | emms-playlist-mode | ess-help-mode | etags-select-mode | fj-mode | gc-issues-mode | gdb-breakpoints-mode | gdb-disassembly-mode | gdb-frames-mode | gdb-locals-mode | gdb-memory-mode | gdb-registers-mode | gdb-threads-mode | gist-list-mode | gnus-article-mode | gnus-browse-mode | gnus-group-mode | gnus-server-mode | gnus-summary-mode | gomoku-mode | google-maps-static-mode | jde-javadoc-checker-report-mode | magit-popup-mode | magit-popup-sequence-mode | mh-folder-mode | monky-mode | mpuz-mode | notmuch-hello-mode | notmuch-search-mode | notmuch-show-mode | notmuch-tree-mode | pdf-outline-buffer-mode | pdf-view-mode | proced-mode | rcirc-mode | rebase-mode | recentf-dialog-mode | reftex-select-bib-mode | reftex-select-label-mode | reftex-toc-mode | sldb-mode | slime-inspector-mode | slime-thread-control-mode | slime-xref-mode | snake-mode | solitaire-mode | sr-buttons-mode | sr-mode | sr-tree-mode | sr-virtual-mode | tetris-mode | tla-annotate-mode | tla-archive-list-mode | tla-bconfig-mode | tla-bookmarks-mode | tla-branch-list-mode | tla-browse-mode | tla-category-list-mode | tla-changelog-mode | tla-follow-symlinks-mode | tla-inventory-file-mode | tla-inventory-mode | tla-lint-mode | tla-logs-mode | tla-revision-list-mode | tla-revlog-mode | tla-tree-lint-mode | tla-version-list-mode | twittering-mode | urlview-mode | vm-mode | vm-summary-mode | w3m-mode | wab-compilation-mode | xgit-annotate-mode | xgit-changelog-mode | xgit-diff-mode | xgit-revlog-mode | xhg-annotate-mode | xhg-log-mode | xhg-mode | xhg-mq-mode | xhg-mq-sub-mode | xhg-status-extra-mode | magit-show-branches-mode | svn-status-mode | dvc-log-edit-mode | project-buffer-mode | gtags-selection-mode | speedbar-mode | picpocket-mode | vterm-mode | elfeed-mode | magit-show-branches-mode | svn-status-mode | dvc-log-edit-mode | project-buffer-mode | gtags-selection-mode | speedbar-mode | picpocket-mode | vterm-mode | elfeed-mode | bufler-mode | svn-status-mode | dvc-log-edit-mode | project-buffer-mode | gtags-selection-mode | speedbar-mode | picpocket-mode | vterm-mode | elfeed-mode | bufler-mode | bufler-list-mode |

